trade_exp/src/InformationRegisters/ЖурналРаботыТСД/ЖурналРаботыТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="904204ca-b505-40d9-ab77-91efafb3e72c">
  <name>ЖурналРаботыТСД</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="198e6b45-296a-43ad-b31b-58e5a7472d98">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="e0085dec-4f43-41d1-acb4-e9618ec044c1">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="4a87aa31-1f35-41a1-852a-55983e82c4a0">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0ed7e719-6d91-49d0-96f6-4361d7ee0461">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9cd36ae-3b67-4ce7-acb8-a5604211090f">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4fe9aacb-81af-4847-9815-8e8ecc83ac88">
    <name>ИдентификаторКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="555f1c4f-02e2-493e-bd5a-5e1596a1014e">
    <name>НомерСеанса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЖурналРаботыТСД/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ЗаписатьСобытие(Событие,Комментарий="",Документ=Неопределено,Сотрудник=Неопределено,ИдентификаторКлиента=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Сотрудник = ?(Сотрудник = Неопределено,Альтерра_СкладСервер.ТекущийСотрудник(),Сотрудник);
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		НаборЗаписей= РегистрыСведений.ЖурналРаботыТСД.СоздатьНаборЗаписей();
		Запись= НаборЗаписей.Добавить();
		Запись.Период= ТекущаяДата();
		Запись.Сотрудник = Сотрудник;
		Запись.Подразделение = Сотрудник.Подразделение;
		Запись.Склад = Сотрудник.Склад;
		Запись.ИдентификаторКлиента = ?(ИдентификаторКлиента=Неопределено,Альтерра_СкладСервер.ПолучитьИдентификаторКлиента(),ИдентификаторКлиента);
		Запись.Событие = Событие;
		Запись.Комментарий = Комментарий; 
		Запись.Документ = Документ; 
        Запись.НомерСеанса = НомерСеансаИнформационнойБазы();    
		Попытка
			НаборЗаписей.Записать(Ложь);
		Исключение
			АльтерраОбщегоНазначения.СообщитьПользователю(,ОписаниеОшибки());
		КонецПопытки
	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
#КонецЕсли
